'''
Дан текстовий файл f. Записати в файл g зі збереженням порядку проходження
ті символи файлу f, яким в цьому файлі передує перше поєднання 'qwe'.
Гармідер Анастасія 122В
'''

list = 'qwe' #поєднання 'qwe'
with open("file_1.txt", 'r') as f, open("file_2.txt", 'w') as g: #працюємо з двома файлами f і g
    for line in f: #проходимось по елементам файлу f
        if line[:3] == list: #використовуємо зріз, щоб перевірити чи передує перше поєднання 'qwe'
            g.write(line) #записуємо ці слова у файл d

